select t.topic,t.sub_topic,t.subco_topic,t.subject,t.right_u_c_e_p,

-- ส่งเสริมสุขภาพและป้องกันโรค (PP)
count(if(t.right_u_c_e_p  in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' ,1,null)) as UC1,
count(if(t.right_u_c_e_p  in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list = '' ,1,null)) as UC1_1,
count(if(t.right_u_c_e_p  in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'การสร้างเสริมภูมิคุ้มกันโรคด้วยวัคซีน' ,1,null)) as UC1_2,
count(if(t.right_u_c_e_p  in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'การฝากครรภ์, ตรวจหลังคลอด' ,1,null)) as UC1_3,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'ตรวจคัดกรองความเสี่ยง' ,1,null)) as UC1_4,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'วางแผนครอบครัว' ,1,null)) as UC1_5,
count(if(t.right_u_c_e_p  in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'บริการทันตกรรม' ,1,null)) as UC1_6,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'ดูแลสุขภาพผู้ป่วยที่บ้าน' ,1,null)) as UC1_7,

count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' ,1,null)) as LGO1,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list = '' ,1,null)) as LGO1_1,
count(if(t.right_u_c_e_p  = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'การสร้างเสริมภูมิคุ้มกันโรคด้วยวัคซีน' ,1,null)) as LGO1_2,
count(if(t.right_u_c_e_p  = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'การฝากครรภ์, ตรวจหลังคลอด' ,1,null)) as LGO1_3,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'ตรวจคัดกรองความเสี่ยง' ,1,null)) as LGO1_4,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'วางแผนครอบครัว' ,1,null)) as LGO1_5,
count(if(t.right_u_c_e_p  = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'บริการทันตกรรม' ,1,null)) as LGO1_6,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'ส่งเสริมสุขภาพและป้องกันโรค (PP)' and t.invoice_list  = 'ดูแลสุขภาพผู้ป่วยที่บ้าน' ,1,null)) as LGO1_7,

-- กรณัใช้สิทธิเจ็บป่วยฉุกเฉิน
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีเจ็บป่วยฉุกเฉิน' ,1,null)) as UC2,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีเจ็บป่วยฉุกเฉิน' ,1,null)) as LGO2,

-- กรณีประสบอุบัติเหตุ
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีประสบอุบัติเหตุ' ,1,null)) as UC3,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีประสบอุบัติเหตุ' ,1,null)) as LGO3,

-- กรณีสิทธิเด็กแรกเกิด
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีสิทธิเด็กแรกเกิด' ,1,null)) as UC4,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีสิทธิเด็กแรกเกิด' ,1,null)) as LGO4,

-- กรณีสิทธิทหารผ่านศึก
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีสิทธิทหารผ่านศึก' ,1,null)) as UC5,
count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีสิทธิทหารผ่านศึก' ,1,null)) as LGO5,

-- 'กรณีสิทธิผู้พิการ'
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีสิทธิผู้พิการ' ,1,null)) as UC6,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีสิทธิผู้พิการ' ,1,null)) as LGO6,

-- 'กรณีสิทธิว่าง'
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีสิทธิว่าง' ,1,null)) as UC7,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีสิทธิว่าง' ,1,null)) as LGO7,

-- กรณีเข้ารับบริการในระบบ DMIS และอื่นๆ
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีกองทุนไต' ,1,null)) as UC8_1,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กองทุนพัฒนาระบบบริการตติยภูมิเฉพาะด้าน' ,1,null)) as UC8_2,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กองทุนพัฒนาระบบบริการปฐมภูมิ' ,1,null)) as UC8_3,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กองทุนพัฒนาระบบบริการอื่นๆ' ,1,null)) as UC8_4,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'การฟื้นฟูสมรรถภาพทางการแพทย์' ,1,null)) as UC8_5,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'การฟื้นฟูสมรรถภาพคนพิการ' ,1,null)) as UC8_6,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'การรักษาพยาบาลแพทย์ทางเลือก' ,1,null)) as UC8_7,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'โครงการดูแลระยะยาวผู้สูงอายุ/Long Term Care' ,1,null)) as UC8_8,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'บริการจิตเวชเรื้อรังในชุมชน' ,1,null)) as UC8_9,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'บริหารจัดการโรคเฉพาะ (Disease Management)' ,1,null)) as UC8_10,

count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีกองทุนไต' ,1,null)) as LGO8_1,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กองทุนพัฒนาระบบบริการตติยภูมิเฉพาะด้าน' ,1,null)) as LGO8_2,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กองทุนพัฒนาระบบบริการปฐมภูมิ' ,1,null)) as LGO8_3,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กองทุนพัฒนาระบบบริการอื่นๆ' ,1,null)) as LGO8_4,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'การฟื้นฟูสมรรถภาพทางการแพทย์' ,1,null)) as LGO8_5,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'การฟื้นฟูสมรรถภาพคนพิการ' ,1,null)) as LGO8_6,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'การรักษาพยาบาลแพทย์ทางเลือก',1,null)) as LGO8_7,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'โครงการดูแลระยะยาวผู้สูงอายุ/Long Term Care' ,1,null)) as LGO8_8,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'บริการจิตเวชเรื้อรังในชุมชน' ,1,null)) as LGO8_9,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'บริหารจัดการโรคเฉพาะ (Disease Management)' ,1,null)) as LGO8_10,


-- กรณีใช้สิทธิรับบริการและบำบัดรักษาโรคทั่วไป
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)') and t.subco_topic = 'กรณีรักษาโรคทั่วไป' ,1,null)) as UC9,
count(if(t.right_u_c_e_p = 'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีรักษาโรคทั่วไป' ,1,null)) as LGO9,


	-- กรณีการตรวจวินิจฉัยโรค
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'การตรวจวินัจฉัยทางเทคนิคการแพทย์และพยาธิวิทยา (เช่น Lab)',1,null)) as UC9_1_1,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'การตรวจวินิจฉัยด้วยวิธีพิเศษอื่นๆ (เช่น MRI, CT ฯลฯ)',1,null)) as UC9_1_2,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'ค่ารักษาพยาบาล (ทั้งบิลใบเสร็จ)',1,null)) as UC9_1_3,

count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'การตรวจวินัจฉัยทางเทคนิคการแพทย์และพยาธิวิทยา (เช่น Lab)',1,null)) as LGO9_1_1,
count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'การตรวจวินิจฉัยด้วยวิธีพิเศษอื่นๆ (เช่น MRI, CT ฯลฯ)',1,null)) as LGO9_1_2,
count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'   and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list  = 'ค่ารักษาพยาบาล (ทั้งบิลใบเสร็จ)',1,null)) as LGO9_1_3,

	-- กรณีค่ายา
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'โลหิตและส่วนประกอบของโลหิต',1,null)) as UC9_2,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list in ('ยาในบัญชี','ยานอกบัญชี','สารน้ำ สารอาหารทางหลอดเลือด'),1,null)) as LGO9_2,

count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'โลหิตและส่วนประกอบของโลหิต',1,null)) as UC9_3,
count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list in ('ยาในบัญชี','ยานอกบัญชี','สารน้ำ สารอาหารทางหลอดเลือด'),1,null)) as LGO9_3,

    -- กรณีค่าอุปกรณ์ เวชภัณฑ์ทางการแพทย์
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อวัยวะเทียม/อุปกรณ์เวชภัณฑ์ที่ไม่ใช่ยา',1,null)) as UC9_4,
count(if(t.right_u_c_e_p  =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อวัยวะเทียม/อุปกรณ์เวชภัณฑ์ที่ไม่ใช่ยา',1,null)) as LGO9_4,
 
	-- กรณีรังสีรักษา
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'การตรวจวินิจฉัยและรักษาทางรังสีวิทยา (X-ray)',1,null)) as UC9_5,
 count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'การตรวจวินิจฉัยและรักษาทางรังสีวิทยา (X-ray)',1,null)) as LGO9_5,
 
	-- กรณีค่าห้อง ค่าอาหาร
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าห้อง/ค่าอาหาร',1,null)) as UC9_6,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าห้อง/ค่าอาหาร',1,null)) as LGO9_6,

	-- กรณีคลอดบุตร
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าคลอดบุตร',1,null)) as UC9_7,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าคลอดบุตร',1,null)) as LGO9_7,

	-- กรณีค่ารถพยาบาล ค่าพาหนะรับส่งผู้ป่วย
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าพาหนะรับส่งต่อ (เช่น เรือ รถ เฮลิคอปเตอร์)',1,null)) as UC9_8,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list =  'ค่าพาหนะรับส่งต่อ (เช่น เรือ รถ เฮลิคอปเตอร์)',1,null)) as LGO9_8,

	-- อื่นๆ
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อื่นๆ',1,null)) as UC9_9_1,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'Rx ค่าทำหัตถการและบริการวิสัญญี (เช่น ค่าผ่าตัด, ทำแผล)',1,null)) as UC9_9_2,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางการแพทย์/พยาบาล (เช่น ใบรับรองแพทย์, ค่าธรรมเนียมอื่นๆ)',1,null)) as UC9_9_3,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางทันตกรรม (การรักษา)',1,null)) as UC9_9_4,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางกายภาพบำบัดและเวชกรรมฟื้นฟู/ค่าบริการฝังเข็ม',1,null)) as UC9_9_5,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการห้องผ่าตัด (เช่น ค่าเปิดห้องผ่าตัด)',1,null)) as UC9_9_6,
count(if(t.right_u_c_e_p in ('สิทธิหลักประกันสุขภาพแห่งชาติ','สิทธิหลักประกันสุขภาพแห่งชาติ (ผู้ประกันตนคนพิการ)')  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อื่นๆ',1,null)) as UC9_9_7,


count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น' and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อื่นๆ',1,null)) as LGO9_9_1,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'Rx ค่าทำหัตถการและบริการวิสัญญี (เช่น ค่าผ่าตัด, ทำแผล)',1,null)) as LGO9_9_2,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางการแพทย์/พยาบาล (เช่น ใบรับรองแพทย์, ค่าธรรมเนียมอื่นๆ)',1,null)) as LGO9_9_3,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางทันตกรรม (การรักษา)',1,null)) as LGO9_9_4,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการทางกายภาพบำบัดและเวชกรรมฟื้นฟู/ค่าบริการฝังเข็ม',1,null)) as LGO9_9_5,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'ค่าบริการห้องผ่าตัด (เช่น ค่าเปิดห้องผ่าตัด)',1,null)) as LGO9_9_6,
count(if(t.right_u_c_e_p =  'สิทธิสวัสดิการพนักงานส่วนท้องถิ่น'  and t.subco_topic = 'กรณีรักษาโรคทั่วไป' and t.invoice_list = 'อื่นๆ',1,null)) as LGO9_9_7



from ticket t 
left join province pr
on t.incidprovin = pr.name
left join nhso_zone nhz			
on pr.nhso_zone_id  = nhz.id 
where  t.topic = 'ร้องเรียน' and t.sub_topic = 'ไม่ได้รับบริการตามสิทธิที่กำหนด' 
and t.first_check = 'ตรวจสอบเบื้องต้นมีมูลความจริง' and t.work_status = 'ยุติ'
and t.pass_to_new in ('[]','NULL')
and $X{IN,nhz.name,zone_name} 
and t.created_at between $P{start_date_time} and  $P{end_date_time}